In [1]:
#exer 1, #3
from env import get_db_url
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
pd.read_sql('SELECT * FROM employees LIMIT 5',get_db_url("employees"))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [3]:
#5a - url typo
#pd.read_sql('SELECT * FROM employees LIMIT 5',emp_url+'hi') 
#Operational Error
#1044 access denied for user

In [4]:
#5b - SQL query error typo
#pd.read_sql('SELECT * FROM employee LIMIT 5',emp_url)
#ProgrammingError
#1146, "Table 'employees.employee' doesn't exist"
#. Seems to return the error from SQL

In [5]:
#6
emp = pd.read_sql('SELECT * FROM employees',get_db_url("employees"))
ttl = pd.read_sql('SELECT * FROM titles',get_db_url("employees"))

In [6]:
#7
print(emp.shape)
print(ttl.shape)

(300024, 6)
(443308, 4)

In [7]:
#8
emp.describe() #only describes numeric columns (ignores strings and dates)
ttl.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [8]:
#9
ttl.title.nunique()

7

In [9]:
#10
#imported datetime above
# ttl['d'], ttl['m'], ttl['y'] = ttl.to_date.str.split('-')
# ttl['to_date'].str.split('-')
ttl.to_date.min()
#APPARENTLY PANDAS HAS DATETIME?!

datetime.date(1985, 3, 1)

In [10]:
ttl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
dtypes: int64(1), object(3)
memory usage: 13.5+ MB

In [11]:
#11
ttl.to_date.max()

datetime.date(9999, 1, 1)

In [12]:
#Odd alternative
#even though column identified as object, needs to be converted to str
#then split into 3 columns
ttl[['t_y','t_m','t_d']] = ttl.to_date.astype(str).str.split('-',expand=True)

## Exercises - Part 2

In [13]:
#1
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [14]:
#2 - right join
users.merge(roles,how='right',left_on='role_id',right_on='id',indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [15]:
#3 - outer join
users.merge(roles,how='outer',left_on='role_id',right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [16]:
#4
#this question is odd. 
users.merge(roles) #gets empty table
u2 = users.drop(columns='role_id')
r2 = roles.drop(columns='id')
u2.merge(r2) #gets the same empy df
#u2.merge(r2,how='outer',left_on='role_id',right_on='id') 
#naturally throws an error, since I deleted these columns

Empty DataFrame
Columns: [id, name]
Index: []

In [17]:
#5 - load mpg
mpg = data('mpg')

In [18]:
#6 - mpg doc
data('mpg',show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [19]:
#7 - num rows/cols
print(f'The mpg dataframe has {mpg.shape[0]} rows and {mpg.shape[1]} columns')

The mpg dataframe has 234 rows and 11 columns

In [20]:
#8
mpg.rename(columns={'manufacturer':'make'},inplace=True)

In [21]:
#9
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [22]:
#10
print(f'There are {mpg.make.nunique()} manufacturers in this dataset')

There are 15 manufacturers in this dataset

In [23]:
#11
print(f'There are {mpg.model.nunique()} models in this dataset')

There are 38 models in this dataset

In [24]:
#12
mpg['mpg_diff'] = mpg.hwy - mpg.cty

In [25]:
#13
mpg['avg_mpg'] = (mpg.hwy)

In [26]:
#14
mpg.trans.unique() #confirm format of the column
mpg['is_automatic']=mpg.trans.str.startswith('a')

In [27]:
#15
mpg.groupby('make').agg({'avg_mpg':'mean'}).nlargest(columns = 'avg_mpg',n=1)

         avg_mpg
make
honda  32.555556

In [28]:
#16
mpg.groupby('is_automatic').agg({'avg_mpg':'mean'}) 
#manuals have better mpg

                avg_mpg
is_automatic
False         25.779221
True          22.292994

## Exercise - Part 3

In [29]:
#1 Get orders from chipotle database
chipo = pd.read_sql("SELECT * FROM orders",get_db_url('chipotle'))

In [44]:
#2 - total price per order
#convert item price column to number
mk_flt = lambda x: float(x[1:-1]) #drops off first character then converts
chipo.item_price = chipo.item_price.apply(mk_flt)
#create revenue column
chipo['rev'] = chipo.quantity * chipo.item_price
#group by order_id and sum up rev column
chipo.groupby('order_id').agg({'rev':'sum'})

#apparently item_price already includes quantity.  SO the real answers is
chipo.groupby('order_id').agg({'item_price':'sum'})

          item_price
order_id
1              11.56
2              16.98
3              12.67
4              21.00
5              13.70
...              ...
1830           23.00
1831           12.90
1832           13.20
1833           23.50
1834           28.75

[1834 rows x 1 columns]

In [31]:
#3 What are the most popular 3 items
chipo.groupby('item_name').agg({'quantity':'sum'}).nlargest(columns='quantity',n=3)

                     quantity
item_name
Chicken Bowl              761
Chicken Burrito           591
Chips and Guacamole       506

In [46]:
#4 Which item produced the most revenue
chipo.groupby('item_name').agg({'item_price':'sum'}).nlargest(columns='item_price',n=1)

              item_price
item_name
Chicken Bowl     7342.73

In [33]:
#5 join emp & ttl
emp_ttl = emp.merge(ttl,on='emp_no') #default how is inner
emp_ttl.head()

,emp_no,birth_date,first_name,last_name,gender,hire_date,title,from_date,to_date,t_y,t_m,t_d
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,Senior Engineer,1986-06-26,9999-01-01,9999,01,01
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,Staff,1996-08-03,9999-01-01,9999,01,01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,Senior Engineer,1995-12-03,9999-01-01,9999,01,01
3,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Engineer,1986-12-01,1995-12-01,1995,12,01
4,10004,1954-05-01,Chirstian,Koblick,M,1986-12-01,Senior Engineer,1995-12-01,9999-01-01,9999,01,01

In [47]:
#6 for each title, find hire date of most recently hired emp
#Assumptions: 
#  Only want employees still holding that title
#  This has potential to not show all titles (i'm okay with that)

# get all emp_no currently holding title, group by title, 
emp_ttl[emp_ttl.t_y == '9999'].groupby('title',as_index=False).agg({'hire_date':'max'})

                title  hire_date
0  Assistant Engineer 1999-12-24
1            Engineer 2000-01-23
2             Manager 1992-02-05
3     Senior Engineer 2000-01-01
4        Senior Staff 2000-01-13
5               Staff 2000-01-12
6    Technique Leader 1999-12-15

In [48]:
#6 Better - I realistically may want more than just the actual date
#max works on dates, but idxmax does not!
emp_ttl[emp_ttl.t_y == '9999'].groupby('title').hire_date.max() 

#since idxmax wasn't working, so more explicitly set hire_date as datetime
emp_ttl.hire_date = pd.to_datetime(emp_ttl.hire_date)
#need to understand difference between 'object datetime' and 'dtype datetime'

#now use idxmin >> return entire row - or at least the columns i want
emp_ttl.loc[emp_ttl[emp_ttl.t_y == '9999'].groupby('title').hire_date.idxmax()][['title','hire_date','emp_no']]

                     title  hire_date  emp_no
212605  Assistant Engineer 1999-12-24  243702
337630            Engineer 2000-01-23  428377
148155             Manager 1992-02-05  110420
145474     Senior Engineer 2000-01-01  108201
182100        Senior Staff 2000-01-13  222965
55137                Staff 2000-01-12   47291
357298    Technique Leader 1999-12-15  441722

In [36]:
#7 - find number of titles by department
# T.titles to T.dept_emp to T.departments

#V1 - Bulk of work in SQL
#I assume we want current info >> both title and dep-emp relationship must be current
sql = """
SELECT title, emp_no, dept_name
FROM dept_emp
JOIN titles USING(emp_no)
JOIN departments USING(dept_no)
WHERE titles.to_date > CURDATE() AND dept_emp.to_date > CURDATE();
"""

#import table to jupyter
ttl_emp_dept = pd.read_sql(sql,get_db_url('employees'))

In [37]:
#Now crosstab
pd.crosstab(ttl_emp_dept.dept_name,ttl_emp_dept.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,68,627,1,1790,11268,3574,241
Development,1652,14040,1,38816,1085,315,5477
Finance,0,0,1,0,9545,2891,0
Human Resources,0,0,1,0,9824,3073,0
Marketing,0,0,1,0,11290,3551,0
Production,1402,12081,1,33625,1123,349,4723
Quality Management,389,3405,1,9458,0,0,1293
Research,77,830,1,2250,9092,2870,321
Sales,0,0,1,0,28797,8903,0

In [38]:
#7 - V2 - Bulk of work in Python

#just get the full tables (titles was already loaded)
dept_emp = pd.read_sql("SELECT * FROM dept_emp",get_db_url('employees'))
departments = pd.read_sql("SELECT * FROM departments",get_db_url('employees'))

In [39]:
#Rename duplicate colums
dept_emp.rename(columns={'to_date':'de_to_date'},inplace=True)
ttl.rename(columns={'to_date':'ttl_to_date'},inplace=True)

In [40]:
#Fun with Merging!
# dept_emp.merge(departments,on='dept_no')
ttl_emp_dept_v2 = dept_emp.merge(departments,on='dept_no').merge(ttl,on="emp_no")

In [41]:
print(ttl_emp_dept_v2.shape) #confirm same # of rows as SQL output (without conditions)
print(ttl_emp_dept_v2.columns) #I see the columns I need

(489903, 11)
Index(['emp_no', 'dept_no', 'from_date_x', 'de_to_date', 'dept_name', 'title',
       'from_date_y', 'ttl_to_date', 't_y', 't_m', 't_d'],
      dtype='object')

In [42]:
#now, filter out non-current data and store only the columns I need back in the df
#Can't use this logic b/c technically not string
# (ttl_emp_dept_v2.de_to_date.str.startswith('9')
#instead probably need to convert to datetime
# ttl_emp_dept_v2.de_to_date = pd.to_datetime(ttl_emp_dept_v2.de_to_date)
# ^^Didn't work b/c yr 9999 is out of range

#try to just look at first character
# ttl_emp_dept_v2.ttl_to_date[:,0]
#Nope, returns datetime.date(9999, 1, 1)
type(ttl_emp_dept_v2.ttl_to_date) #pandas.core.series.Series

#alright, lets convert to string, check first char, then drops some stuff
ttl_emp_dept_v2 = ttl_emp_dept_v2[(ttl_emp_dept_v2.ttl_to_date.astype(str).str.startswith('9')) & (ttl_emp_dept_v2.de_to_date.astype(str).str.startswith('9'))]

In [43]:
pd.crosstab(ttl_emp_dept_v2.dept_name,ttl_emp_dept_v2.title)

title,Assistant Engineer,Engineer,Manager,Senior Engineer,Senior Staff,Staff,Technique Leader
dept_name,,,,,,,
Customer Service,68,627,1,1790,11268,3574,241
Development,1652,14040,1,38816,1085,315,5477
Finance,0,0,1,0,9545,2891,0
Human Resources,0,0,1,0,9824,3073,0
Marketing,0,0,1,0,11290,3551,0
Production,1402,12081,1,33625,1123,349,4723
Quality Management,389,3405,1,9458,0,0,1293
Research,77,830,1,2250,9092,2870,321
Sales,0,0,1,0,28797,8903,0